Revit 2024 API
AnalysisDisplayStyleMarkerTextLabelType Enumeration
 Text label visualization types for Markers and Text settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum AnalysisDisplayStyleMarkerTextLabelType
Visual Basic
Public Enumeration AnalysisDisplayStyleMarkerTextLabelType
Visual C++
public enum class AnalysisDisplayStyleMarkerTextLabelType
Members
Member name | Description
ShowAll |  Show text markers for each point
ShowNone |  Don't show text markers
ShowPredefined |  Show text markers only for points that have flag ValueAtPointFlags::DisplayText
See Also
Autodesk.Revit.DB.Analysis Namespace